
	.global G_sha1_block

	.cpu generic+fp+simd+crypto

# ---------------------------------
// >>> IN
// [ハッシュ初期値] v0, s1 : (D C B A), E
// [512 bits ブロック] v20, 21, 28, 23 (注意：ビッグエンディアンで値を格納すること)
//
// <<< OUT
// [ハッシュ結果] v0, s1 : (D C B A), E

// v16 : k + w に利用
// v17 : k に利用
// v18 , v19 : e に利用
// v20 - v23 : w に利用

G_sha1_block:
		// デバッグ用の表示ルーチンをコールしないのであれば、以下の lr の退避は不要
		stp		x0, lr, [sp, #-16]!

		// ----------------------
		// 最後に初期値を加算する必要があるため、v0 の値を退避（v1 は破壊されない）
		mov		v31.16b, v0.16b	// v31 <- ABCD 待避

		# ====================
		// LOOP 0 -> 19
		adr		x0, L_rcon
		ld1		{v17.4s}, [x0], 16		// v17.4s : 0x5a827999（key 1）

		#1 ----------
		sha1h	s19, s0					// s19 = ROL(a0, 30)（=e4）
		
		add		v16.4s, v17.4s, v20.4s	// v16 = k1 + (3 2 1 0)
		sha1c	q0, s1, v16.4s
		// v0: (d0 c0 b0 a0), s1: e0, v16: k1 + (3 2 1 0)
		// sha1c = (((b EOR c) AND a) EOR c) = (b & c) | (~b & d)
		// f = (b0 & c0) | (~b0 & d0)
		// y = ROL(a0, 5) + e0 + f + k1 + w[0]
		// b' = ROL(b0, 30)
		// (e', v0) = ROL((y d0 c0 b' a0), 32) = (d0 c0 b' a0 y)
		// v0 = (d1 c1 b1 a1)
		// ...
		// v0 = (d4 c4 b4 a4)
	
		sha1su0	v20.4s, v21.4s, v22.4s
		// v20: (3 2 1 0), v21: (7 6 5 4), v22: (11 10 9 8)
		// v20 = (11 10 9 8) ^ (5 4 3 2) ^ (3 2 1 0)

		sha1su1	v20.4s, v23.4s
		// v20: (11 10 9 8) ^ (5 4 3 2) ^ (3 2 1 0)
		// v23: (15 14 13 12)
		// t = (. 15 14 13) ^ (11 10 9 8) ^ (5 4 3 2) ^ (3 2 1 0)
		// v20 = ROL1((. 15 14 13) ^ (11 10 9 8) ^ (5 4 3 2) ^ (3 2 1 0))
		//		^ ROL2((13 . . .) ^ (8 . . .) ^ (2 . . .) ^ (0 . . .))
		//     = ROL1((. 15 14 13) ^ (11 10 9 8) ^ (5 4 3 2) ^ (3 2 1 0))
		//		^ ROL1(16 . . .)
		//     = (19 18 17 16)
		
		#2 ----------
		sha1h	s18, s0					// s18 = ROL(a4, 30)（=e8）

		add		v16.4s, v17.4s, v21.4s	// v16 = k1 + (7 6 5 4)	
		sha1c	q0, s19, v16.4s			// v0 = (d8 c8 b8 a8)
		
		sha1su0	v21.4s, v22.4s, v23.4s
		// v21: (7 6 5 4), v22: (11 10 9 8), v23: (15 14 13 12)
		// v21 = (15 14 13 12) ^ (9 8 7 6) ^ (7 6 5 4)
		
		sha1su1	v21.4s, v20.4s
		// v21: (15 14 13 12) ^ (9 8 7 6) ^ (7 6 5 4)
		// v20: (19 18 17 16)
		// t = (. 19 18 17) ^ (15 14 13 12) ^ (9 8 7 6) ^ (7 6 5 4)
		// v21 = ROL1((. 19 18 17) ^ (15 14 13 12) ^ (9 8 7 6) ^ (7 6 5 4))
		//		^ ROL2((17 . . .) ^ (12 . . .) ^ (6 . . .) ^ (4 . . .))
		//     = ROL1((. 19 18 17) ^ (15 14 13 12) ^ (9 8 7 6) ^ (7 6 5 4))
		//		^ ROL1(20 . . .)
		//     = (23 22 21 20)
		
		#3 ----------
		sha1h	s19, s0					// s19 = ROL(a8, 30)（=e12）	

		add		v16.4s, v17.4s, v22.4s	// v16 = k1 + (11 10 9 8)
		sha1c	q0, s18, v16.4s			// v0 = (d12, c12, b12, a12)
		
		sha1su0	v22.4s, v23.4s, v20.4s
		sha1su1	v22.4s, v21.4s			// v22 = (27 26 25 24)	
		
		#4 ----------
		sha1h	s18, s0 				// s18 = ROL(a12, 30) (=e16)

		add		v16.4s, v17.4s, v23.4s	// v16 = k1 + (15 14 13 12)
		sha1c	q0, s19, v16.4s			// v0 = (d16, c16, b16, a16)

		sha1su0	v23.4s, v20.4s, v21.4s
		sha1su1	v23.4s, v22.4s			// v23 = (31 30 29 28)
	
		#5 ----------
		sha1h	s19, s0 				// s19 = ROL(a16, 30) (=e20)

		add		v16.4s, v17.4s, v20.4s	// v16 = k1 + (19 18 17 16)
		sha1c	q0, s18, v16.4s			// v0 = (d20, c20, b20, a20)

		sha1su0	v20.4s, v21.4s, v22.4s
		sha1su1	v20.4s, v23.4s			// v20 = (35 34 33 32)
	
		# ====================
		// LOOP 20 -> 39
		ld1		{v17.4s}, [x0], 16		// v17.4s : 0x6ed9eba1（key 2）

		#1 ----------
		sha1h	s18, s0					// s18 = ROL(a20, 30) (=e24)

		add		v16.4s, v17.4s, v21.4s	// v16 = k2 + (23 22 21 20)		
		sha1p	q0, s19, v16.4s
		// v0: (d20 c20 b20 a20), s19: e20, v16: k2 + (23 22 21 20)
		// f = b20 ^ c20 ^ d20
		// y = ROL(a20, 5) + e20 + f + k2 + w[20]
		// b' = ROL(b, 30)
		// (e', v0) = ROL(y d20 c20 b' a20, 32) = (d20 c20 b' a20 y)
		// v0 = (d21 c21 b21 a21)
		// ...
		// v0 = (d24 c24 b24 a24)
		
		sha1su0	v21.4s, v22.4s, v23.4s
		sha1su1	v21.4s, v20.4s			// v21 = (39 38 37 36)
	
		#2 ----------
		sha1h	s19, s0					// s19 = ROL(a24, 30) (=e28)

		add		v16.4s, v17.4s, v22.4s	// v16 = k2 + (27 26 25 24)		
		sha1p	q0, s18, v16.4s			// v0 = (d28 c28 b28 a28)		
		
		sha1su0	v22.4s, v23.4s, v20.4s
		sha1su1	v22.4s, v21.4s			// v22 = (43 42 41 40)

		#3 ----------
		sha1h	s18, s0					// s18 = ROL(a28, 30) (=e32)

		add		v16.4s, v17.4s, v23.4s	// v16 = k2 + (31 30 29 28)
		sha1p	q0, s19, v16.4s			// v0 = (d32 c32 b32 a32)
		
		sha1su0	v23.4s, v20.4s, v21.4s
		sha1su1	v23.4s, v22.4s			// v23 = (47 46 45 44)

		#4 ----------
		sha1h	s19, s0					// s19 = e36

		add		v16.4s, v17.4s, v20.4s	// v16 = k2 + (35 34 33 32)
		sha1p	q0, s18, v16.4s			// v0 = (d36 c36 b36 a36)
		
		sha1su0	v20.4s, v21.4s, v22.4s	// v20: (35 34 33 32)
		sha1su1	v20.4s, v23.4s			// v20 = (51 50 49 48)

		#5 ----------
		sha1h	s18, s0					// s18 = e40

		add		v16.4s, v17.4s, v21.4s	// v16 = k2 + (39 38 37 36)
		sha1p	q0, s19, v16.4s			// v0 = (d40 c40 b40 a40)
		
		sha1su0	v21.4s, v22.4s, v23.4s	// v21: (39 38 37 36)
		sha1su1	v21.4s, v20.4s			// v21 = (55 54 53 52)
	
		# ====================
		// LOOP 40 -> 59
		ld1		{v17.4s}, [x0], 16		// v17.4s : 0x8f1bbcdc（key 3）

		#1 ----------
		sha1h	s19, s0					// s19 = e44

		add		v16.4s, v17.4s, v22.4s	// v16 = k3 + (43 42 41 40)
		sha1m	q0, s18, v16.4s
		// v0: (d40 c40 b40 a40), s18: e40, v16: k3 + (43 42 41 40)
		// ((x AND y) OR ((x OR y) AND z)) == (x & y) | (x & z) | (y & z)
		// f = (b40 AND c40) OR ((b40 OR c40) AND d40)
		// y = ROL(a40, 5) + e40 + f + k3 + w[40]
		// b' = ROL(b40, 30)
		// (_, v0) = ROL((y d40 c40 b' a40), 32) = (d40 c40 b' a40 y)
		// v0 = (d41 c41 b41 a41)
		// ...
		// v0 = (d44 c44 b44 a44)
		
		sha1su0	v22.4s, v23.4s, v20.4s	// v22: (43 42 41 40)
		sha1su1	v22.4s, v21.4s			// v22 = (59 58 57 56)

		#2 ----------
		sha1h	s18, s0					// s19 = e48

		add		v16.4s, v17.4s, v23.4s	// v23: (47 46 45 44)
		sha1m	q0, s19, v16.4s			// 0 = (d48 c48 b48 a48)
		
		sha1su0	v23.4s, v20.4s, v21.4s
		sha1su1	v23.4s, v22.4s			// v23 = (63 62 61 60)
	
		#3 ----------
		sha1h	s19, s0					// s19 = e52

		add		v16.4s, v17.4s, v20.4s	// v16: (51 50 49 48)
		sha1m	q0, s18, v16.4s			// v0 = (d52 c52 b52 a52)
		
		sha1su0	v20.4s, v21.4s, v22.4s
		sha1su1	v20.4s, v23.4s			// v20 = (67 66 65 64)

		#4 ----------
		sha1h	s18, s0					// s18 = e56

		add		v16.4s, v17.4s, v21.4s	// v21: (55 54 53 52)
		sha1m	q0, s19, v16.4s			// v0 = (d56 c56 b56 a56)
		
		sha1su0	v21.4s, v22.4s, v23.4s
		sha1su1	v21.4s, v20.4s			// v21 = (71 70 69 68)
		
		#5 ----------
		sha1h	s19, s0					// s19 = e60

		add		v16.4s, v17.4s, v22.4s	// v22: (59 58 57 56)
		sha1m	q0, s18, v16.4s			// v0 = (d60 c60 b60 a60)
		
		sha1su0	v22.4s, v23.4s, v20.4s
		sha1su1	v22.4s, v21.4s			// v22 = (75 74 73 72)
	
		# ====================
		// LOOP 60 -> 79
		ld1		{v17.4s}, [x0]			// v17.4s : 0xca62c1d6（key 4）

		#1 ----------	
		sha1h	s18, s0					// s19 = e64

		add		v16.4s, v17.4s, v23.4s	// v23: (63 62 61 60)
		sha1p	q0, s19, v16.4s			// v0 = (d64 c64 b64 a64)
		
		sha1su0	v23.4s, v20.4s, v21.4s
		sha1su1	v23.4s, v22.4s			// v23: (79 78 77 76)
	
		#2 ----------	
		sha1h	s19, s0					// s19 = e68

		add		v16.4s, v17.4s, v20.4s	// v20: (67 66 65 64)
		sha1p	q0, s18, v16.4s			// v0 = (d68 c68 b68 a68)
	
		#3 ----------	
		sha1h	s18, s0					// s18 = e72

		add		v16.4s, v17.4s, v21.4s	// v21: (71 70 69 68)
		sha1p	q0, s19, v16.4s			// v0 = (d72 c72 b72 a72)
			
		#4 ----------	
		sha1h	s19, s0					// s19 = e76

		add		v16.4s, v17.4s, v22.4s	// v22: (75 74 73 72)
		sha1p	q0, s18, v16.4s			// v0 = (d76 c76 b76 a76)

		#5 ----------	
		sha1h	s18, s0					// s18 = e80

		add		v16.4s, v17.4s, v23.4s	// v23: (79 78 77 76)
		sha1p	q0, s19, v16.4s			// v0 = (d80 c80 b80 a80)

		# --------------------
		// v0 にハッシュ値 (D C B A)、s1 に E が生成される
		add		v0.4s, v0.4s, v31.4s
		add		v1.4s, v1.4s, v18.4s	// v1.s[0] = e0 + e80	
		
		// デバッグ用の表示ルーチンをコールしないのであれば、以下の lr の退避は不要
		ldp		x0, lr, [sp], #16
		ret

# ---------------------------------
	.align	4
L_rcon:
	.word	0x5a827999, 0x5a827999, 0x5a827999, 0x5a827999  // v4 (= k1)
	.word	0x6ed9eba1, 0x6ed9eba1, 0x6ed9eba1, 0x6ed9eba1	// v5 (= k2)
	.word	0x8f1bbcdc, 0x8f1bbcdc, 0x8f1bbcdc, 0x8f1bbcdc  // v6 (= k3)
	.word	0xca62c1d6, 0xca62c1d6, 0xca62c1d6, 0xca62c1d6  // v7 (= k4)
	
